# PANDAS SERIES

A series is one-dimensional labeled array capable of holding any data type. The axis labels are collectively called the index.

- Import Pandas library

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\harsh kushwaha\onedrive\desktop\data science\venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\harsh kushwaha\onedrive\desktop\data science\venv\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\harsh kushwaha\onedrive\desktop\data science\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\harsh kushwaha\onedrive\desktop\data science\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\harsh kushwaha\onedrive\desktop\data science\venv\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\harsh kushwaha\onedrive\desktop\data science\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

- Creating Series

there are multiple ways to create a Pandas Series.

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_lists = [10,20,30]
arr = np.array([10,20,30])
d = {1:10,2:20,3:30}

In [4]:
pd.Series(my_lists)  #series is created using list with first column as a labels or index points (by default it is 0 , 1 ,2 .....) and second column as data points.

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(my_lists, index=labels)      # here a series is created with manual labels by passing other parameter index = .

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)      #series is created using array with default lebels. (array should be 1-D, not 2-D because series is 1-D)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(d)   # series is created using dictionary with its key as index or label and its values as data points.

1    10
2    20
3    30
dtype: int64

# PANDAS DATAFRAME

- Creating Dataframe

In [8]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}                                                        #  this is a data in dictionary


df = pd.DataFrame(data)    #dataframe is a collection of multiple series combines together

In [9]:
print(df)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [10]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]                                              #  this is a data in list

df2 = pd.DataFrame(data_list)

In [11]:
print(df2)                           #  in dictionary we provide column name using key , but in lists we don't have keys so by default the name of the columns are 0,1,2,3.....

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [12]:
# to give names to columns we use this method 

data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]  

df2 = pd.DataFrame(data_list)

column_name = ["Name","Age","City","Salary"]

df2 = pd.DataFrame(data_list, columns=column_name)

In [13]:
print(df2)     # now the column names are mentioned.

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

- Selection and indexing of columns

In [14]:
print(df2)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [15]:
df2['Name']    # here i want to target only one column for selection (so i use single bracket and the name of column i want to target)

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [16]:
df2[['Name','City']]       # here i want to target more than one column for selection (so i use two brackets and the names of columns i want to target)

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [17]:
df2[['Name','City','Age']]

    Name      City  Age
0   John  New York   28
1   Anna     Paris   34
2  Peter    Berlin   29
3  Linda    London   42

- Creating a new column

In [18]:
df2['Designation'] = ['Doctor','Engineer','Scientist','Artist']  # we have to provide the equal number of values in new column as other columns have (4 values for this example).

In [19]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000   Scientist
3  Linda   42    London   85000      Artist

- Removing a column

THEORY --->  df2.drop('Designation', axis=1) this code will not remove the designation from main data and it only shows the snapshot(copy) of it. To remove the column from main data we have to use this code -> df2.drop('Designation', axis=1, inplace= True).
To remove multiple columns we have to use -> df2.drop(['Designation', 'Salary'], axis=1, inplace= True)

In [20]:
df2.drop('Designation', axis=1)    # it will remove the column (axis=0 means it will search the designation in row's name and axis=1 means it will search the designation in column's name)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [21]:
df2.drop('Designation', axis=1, inplace= True)

In [22]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [23]:
df2.drop(0, axis=0)      # it will remove the row (axis=0 means it will search the 0 in row's name and axis=1 means it will search the 0 in column's name)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

- Selecting Rows

THEORY ---> To select rows we have to use "loc" (location) and it is use for selecting rows.

In [24]:
df2.loc[1]  # this will select a single row we want to target.(only single bracket is used)

Name       Anna
Age          34
City      Paris
Salary    70000
Name: 1, dtype: object

In [25]:
df2.loc[[1,3]]      # this will select a multiple row we want to target.(two brackets are used)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [26]:
df2.iloc[1]        #iloc means index location but in this example rows location is already mentioned as default one like 0,1,2,3,.......

Name       Anna
Age          34
City      Paris
Salary    70000
Name: 1, dtype: object

In [27]:
df2.iloc[[1,3]]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

- Selecting Subsets of Rows and Columns

In [28]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [29]:
df.loc[[0,2]][['City','Salary']]   # it first select complete rows of 0 and 2 and then a column city and salary in it.

       City  Salary
0  New York   65000
2    Berlin   62000

In [30]:
df.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   29
3  Linda   42

- Conditional Selection

In [31]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

 I want to see those people whose age is above 30

In [32]:
df2[df2['Age'] > 30]    # first i target df2 and then i say find the age inside df2 which is greater than 30.

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

I want people whose age is above 30 and their city must be paris.

In [33]:
df2[(df2['Age'] > 30) & (df2['City'] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000

# Missing Data

- Finding Missing Data

In [34]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}                                                # np.nan means not a number value


df = pd.DataFrame(data)

In [35]:
df      #NaN are null or missing values

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [36]:
df.isna()    # it gives True for NaN values and False for other values

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [37]:
df.isna().sum()        #it gives the total number of NaN in each columns

A    1
B    0
C    2
D    3
dtype: int64

In [38]:
df.isna().any()      #it gives true if a column has any NaN value and it gives false if a column has zero NaN values.

A     True
B    False
C     True
D     True
dtype: bool

- Removing Missing Data

In [39]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [40]:
df.dropna()    # it will remove all the rows which has NaN values.

     A  B    C    D
0  1.0  1  1.0  1.0

In [41]:
df.dropna(thresh=3)       # if the row not have atleast 3 non NaN values , then it will be deleted (row 2 and 3 don't have 3 non NaN values so they are removed)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

- Filling the Missing Data

In [42]:
df.fillna(0)          # it will fill 0 in place of all NaN value.

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [43]:
values = {'A':0,'B':100,'C':300,'D':500}        # it will fill o in place of NaN values in A column and 100 in B column and 300 in C column and 500 in D column.
df.fillna(value=values)

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  500.0
2  0.0  3    3.0  500.0
3  4.0  4  300.0  500.0
4  5.0  5  300.0    5.0

In [44]:
df.fillna(df.mean())    # it will fill the NaN values with mean value of whole data

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

# Merging Joining and Concatenation

- Merging 2 Dataframes

In [45]:
# DataFrame 1: Employees information
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [46]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [47]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [48]:
pd.merge(employees, salaries)       # only 3 employee ids came because they are only common employee ids.

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [49]:
pd.merge(employees, salaries, on='employee_id')       # on keyword is used because we merge the dataframes on the basis of columns.

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [50]:
pd.merge(employees, salaries, on='employee_id', how='inner')    # inner means we merge on the basis of common employee_id.

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [51]:
pd.merge(employees, salaries, on='employee_id', how='outer')    # outer means we merge on the basis of complete column employee_id and return each employee_id and also it returns NaN at missing values.

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [52]:
pd.merge(employees, salaries, on='employee_id', how='left')  # merge on the basis of left data we passed (employeed here) , so we get every data of employees here.

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [53]:
pd.merge(employees, salaries, on='employee_id', how='right')  # merge on the basis of right data we passed (salaries here) , so we get every data of salaries here.

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

- Concatenation of 2 Daraframes

In [54]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [55]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [56]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [57]:
pd.concat([df1, df2])   # by default it returns in columwise(axis=0)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [58]:
pd.concat([df2, df1])    # it we pass df2 first then df1

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [59]:
pd.concat([df1, df2], axis=1)   # it concatenates in row basis

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

- Joining 2 Dataframes

In [60]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [61]:
df1

      name
1    Alice
2      Bob
3  Charlie

In [62]:
df2

   score
2     85
3     90
4     75

In [63]:
df1.join(df2, how='outer')  # in df1 we join df2  ( in df1 4 doesn't exist so it returns NaN in name)

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

In [64]:
df2.join(df1, how='outer')  # in df2 we join df1  ( in df2 1 doesn't exist so it returns NaN in score)

   score     name
1    NaN    Alice
2   85.0      Bob
3   90.0  Charlie
4   75.0      NaN

# GroupBy and Aggregation

- Group By

In [65]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)

In [66]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [67]:
# Group by Category and calculate the sum of Sales

cat_sum = df.groupby('Category')['Sales'].sum()   # it returns the sum of sales for each category.

cat_sum

Category
A    570
B    930
Name: Sales, dtype: int64

In [68]:
# Group by Store and calculate the sum of Sales

sto_sum = df.groupby('Store')['Sales'].sum()

sto_sum

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [69]:
# Group by multiple columns
# Group by Category and Store

cat_sto = df.groupby(['Category', 'Store'])['Sales'].sum()

cat_sto

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

- Aggregation

In [70]:
sale_mean = df['Sales'].mean()

print(sale_mean)

187.5

In [71]:
sale_med = df['Sales'].median()

print(sale_med)

190.0

In [72]:
sale_mod = df['Sales'].mode()

print(sale_mod)

0    200
Name: Sales, dtype: int64

In [73]:
sale_min = df['Sales'].min()

print(sale_min)

100

In [74]:
sale_max = df['Sales'].max()

print(sale_max)

300

In [75]:
sale_count = df['Sales'].count()

print(sale_count)

8

In [76]:
sale_std = df['Sales'].std()

print(sale_std)

66.06274074155351

In [77]:
sale_agg = df['Sales'].agg(['mean','median','min','max','count','std'])

print(sale_agg)

mean      187.500000
median    190.000000
min       100.000000
max       300.000000
count       8.000000
std        66.062741
Name: Sales, dtype: float64

# Pivot Tables

- Pivot Tables

In [78]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)

In [79]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    457     16   John  January      Q1
1  2023-01-02       B   West    818     95   Mary  January      Q1
2  2023-01-03       C  North    984     83    Bob  January      Q1
3  2023-01-04       D  South    137     83  Alice  January      Q1
4  2023-01-05       A   East    486     79   John  January      Q1
5  2023-01-06       B   West    301     48   Mary  January      Q1
6  2023-01-07       C  North    889     48    Bob  January      Q1
7  2023-01-08       D  South    174     48  Alice  January      Q1
8  2023-01-09       A   East    347     14   John  January      Q1
9  2023-01-10       B   West    895     98   Mary  January      Q1
10 2023-01-11       C  North    729     34    Bob  January      Q1
11 2023-01-12       D  South    915     78  Alice  January      Q1
12 2023-01-13       A   East    710     65   John  January      Q1
13 2023-01-14       B   West    446     28   Mary  January      Q1
14 2023-01-15       C  North    745     48    Bob  January      Q1
15 2023-01-16       D  South    315     55  Alice  January      Q1
16 2023-01-17       A   East    819     58   John  January      Q1
17 2023-01-18       B   West    206     40   Mary  January      Q1
18 2023-01-19       C  North    410     91    Bob  January      Q1
19 2023-01-20       D  South    448     90  Alice  January      Q1

In [80]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product', aggfunc='median' )   # it returns values of sales.  # by default aggfunction is mean

Product      A      B      C      D
Region
East     486.0    NaN    NaN    NaN
North      NaN    NaN  745.0    NaN
South      NaN    NaN    NaN  315.0
West       NaN  446.0    NaN    NaN

In [81]:
pivot2 =  pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')   # it returns values of both sales and units.

pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     563.8    NaN    NaN    NaN  46.4   NaN   NaN   NaN
North      NaN    NaN  751.4    NaN   NaN   NaN  60.8   NaN
South      NaN    NaN    NaN  397.8   NaN   NaN   NaN  70.8
West       NaN  533.2    NaN    NaN   NaN  61.8   NaN   NaN

- Cross Tabs

In [82]:
pd.crosstab(df['Region'], df['Product'])     # it returns the count of products

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

THEORY ---> To find aggregate function we basically use Pivot table and to find Counts we use Crosstab

# Operations

- DataFrames Basics Operations

In [83]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [84]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [85]:
df1.shape   # it gives number of rows and columns

(5, 3)

In [86]:
df1.columns   # it gives the names of the columns

Index(['A', 'B', 'C'], dtype='object')

In [87]:
df1.info()   # it gives the details of the dataframe like...non-null, counts, datatypes etc..,

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [88]:
df1.describe()   # it gives some statistical data about columns of the dataframe.

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [89]:
df1['A'] + 10   # it adds 10 to each row of column 'A'.

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

- Dataframes Applying Functions

In [90]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [91]:
def square(x):
    return x**2

In [92]:
df1["B"].apply(square)   # it changes the value of B using the function.

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64

In [93]:
df1       # the changes doesn't appear in the dataframe.

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [94]:
df1['B'] = df1["B"].apply(square)    # it apply the changes of B using the function in the dataframe.

In [95]:
df1    # this time the changes apply in the dataframe too.

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500

In [96]:
df1['D'] = df1["B"].apply(square)   # it changes the values of B and assign it to the new column D. So new column is created

In [97]:
df1

   A     B    C        D
0  1   100  100    10000
1  2   400  200   160000
2  3   900  300   810000
3  4  1600  400  2560000
4  5  2500  500  6250000

In [98]:
# df1['D'] = df1["B"].apply(lambda x : x**2)   # instead of functions we can use labda functions too.

# Feature Extraction (Project 1)

- Loading the Data

In [99]:
df = pd.read_csv(r'anime.csv')

In [100]:
df

    Rank                                              Title  Score
0      1  Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...   9.10
1      2  Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...   9.07
2      3  Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...   9.06
3      4  GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...   9.06
4      5  Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...   9.05
5      6  Gintama'TV (51 eps)Apr 2011 - Mar 2012534,105 ...   9.04
6      7  Gintama: The FinalMovie (1 eps)Jan 2021 - Jan ...   9.04
7      8  Hunter x Hunter TV (148 eps)Oct 2011 - Sep 201...   9.04
8      9  Kaguya-sama wa Kokurasetai: Ultra RomanticTV (...   9.04
9     10  Gintama': EnchousenTV (13 eps)Oct 2012 - Mar 2...   9.03
10    11  Shingeki no Kyojin: The Final Season - Kankets...   9.03
11    12  Ginga Eiyuu DensetsuOVA (110 eps)Jan 1988 - Ma...   9.02
12    13  Bleach: Sennen Kessen-hen - Ketsubetsu-tanTV (...   8.99
13    14  Fruits Basket: The FinalTV (13 eps)Apr 2021 - ...   8.99
14    15  Gintama.TV (12 eps)Jan 2017 - Mar 2017302,232 ...   8.98
15    16  GintamaTV (201 eps)Apr 2006 - Mar 20101,034,41...   8.94
16    17  Koe no KatachiMovie (1 eps)Sep 2016 - Sep 2016...   8.94
17    18  3-gatsu no Lion 2nd SeasonTV (22 eps)Oct 2017 ...   8.93
18    19  Clannad: After StoryTV (24 eps)Oct 2008 - Mar ...   8.93
19    20  Code Geass: Hangyaku no Lelouch R2TV (25 eps)A...   8.91
20    21  Gintama Movie 2: Kanketsu-hen - Yorozuya yo Ei...   8.91
21    22  Violet Evergarden MovieMovie (1 eps)Sep 2020 -...   8.89
22    23  Owarimonogatari 2nd SeasonTV (7 eps)Aug 2017 -...   8.88
23    24  Gintama.: Shirogane no Tamashii-hen - Kouhan-s...   8.88
24    25  MonsterTV (74 eps)Apr 2004 - Sep 20051,041,081...   8.87
25    26  Kimi no Na wa.Movie (1 eps)Aug 2016 - Aug 2016...   8.84
26    27  Kaguya-sama wa Kokurasetai: First Kiss wa Owar...   8.84
27    28  Bocchi the Rock!TV (12 eps)Oct 2022 - Dec 2022...   8.83
28    29  The First Slam DunkMovie (1 eps)Dec 2022 - Dec...   8.83
29    30  Vinland Saga Season 2TV (24 eps)Jan 2023 - Jun...   8.82
30    31  Jujutsu Kaisen 2nd SeasonTV (23 eps)Jul 2023 -...   8.82
31    32  Gintama.: Shirogane no Tamashii-henTV (12 eps)...   8.81
32    33  Kingdom 3rd SeasonTV (26 eps)Apr 2020 - Oct 20...   8.81
33    34  Mob Psycho 100 IITV (13 eps)Jan 2019 - Apr 201...   8.80
34    35  Shingeki no Kyojin: The Final SeasonTV (16 eps...   8.80
35    36  Kimetsu no Yaiba: Yuukaku-henTV (11 eps)Dec 20...   8.79
36    37  Kizumonogatari III: Reiketsu-henMovie (1 eps)J...   8.79
37    38  "Oshi no Ko"TV (11 eps)Apr 2023 - Jun 2023645,...   8.79
38    39  Haikyuu!! Karasuno Koukou vs. Shiratorizawa Ga...   8.78
39    40  Sen to Chihiro no KamikakushiMovie (1 eps)Jul ...   8.78
40    41  Monogatari Series: Second SeasonTV (26 eps)Jul...   8.77
41    42  Shingeki no Kyojin: The Final Season Part 2TV ...   8.77
42    43  Hajime no IppoTV (75 eps)Oct 2000 - Mar 200255...   8.76
43    44  Cowboy BebopTV (26 eps)Apr 1998 - Apr 19991,79...   8.75
44    45  Kingdom 4th SeasonTV (26 eps)Apr 2022 - Oct 20...   8.75
45    46  Vinland SagaTV (24 eps)Jul 2019 - Dec 20191,40...   8.74
46    47  Mushishi Zoku Shou 2nd SeasonTV (10 eps)Oct 20...   8.73
47    48  Shouwa Genroku Rakugo Shinjuu: Sukeroku Futata...   8.72
48    49  Mob Psycho 100 IIITV (12 eps)Oct 2022 - Dec 20...   8.71
49    50  Rurouni Kenshin: Meiji Kenkaku Romantan - Tsui...   8.71

In [101]:
df.head()   # it gives by default the top 5 data from dataset.

   Rank                                              Title  Score
0     1  Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...   9.10
1     2  Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...   9.07
2     3  Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...   9.06
3     4  GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...   9.06
4     5  Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...   9.05

In [102]:
df.head(10)  # it gives top 10 data from dataset

   Rank                                              Title  Score
0     1  Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...   9.10
1     2  Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...   9.07
2     3  Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...   9.06
3     4  GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...   9.06
4     5  Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...   9.05
5     6  Gintama'TV (51 eps)Apr 2011 - Mar 2012534,105 ...   9.04
6     7  Gintama: The FinalMovie (1 eps)Jan 2021 - Jan ...   9.04
7     8  Hunter x Hunter TV (148 eps)Oct 2011 - Sep 201...   9.04
8     9  Kaguya-sama wa Kokurasetai: Ultra RomanticTV (...   9.04
9    10  Gintama': EnchousenTV (13 eps)Oct 2012 - Mar 2...   9.03

-make a new column for episode count

In [103]:
df.loc[2]['Title']   #observed that the episode count is present in each title column.

'Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 - Dec 2022474,138 members'

In [104]:
def extract_episodes(txt):   # fuction to extract episodes
    check = False
    data = ""
    for i in txt:
        if i == ")":
            check = False
            return data
        if check == True: 
            data = data + i 
        if i == '(':
            check = True

In [105]:
df['Title'].apply(extract_episodes)   # here we extract episodes

0      64 eps
1      24 eps
2      13 eps
3      51 eps
4      10 eps
5      51 eps
6       1 eps
7     148 eps
8      13 eps
9      13 eps
10      2 eps
11    110 eps
12     13 eps
13     13 eps
14     12 eps
15    201 eps
16      1 eps
17     22 eps
18     24 eps
19     25 eps
20      1 eps
21      1 eps
22      7 eps
23     14 eps
24     74 eps
25      1 eps
26      1 eps
27     12 eps
28      1 eps
29     24 eps
30     23 eps
31     12 eps
32     26 eps
33     13 eps
34     16 eps
35     11 eps
36      1 eps
37     11 eps
38     10 eps
39      1 eps
40     26 eps
41     12 eps
42     75 eps
43     26 eps
44     26 eps
45     24 eps
46     10 eps
47     12 eps
48     12 eps
49      4 eps
Name: Title, dtype: object

In [106]:
df['Episodes'] = df['Title'].apply(extract_episodes)  # we create a new column name Episodes in dataframe.

In [107]:
df['Episodes'] = df['Episodes'].str.replace('eps', "")  # here we replaces string eps with whitespace so that we can perform aggregation functions easily.

In [108]:
df['Episodes'] = df['Episodes'].astype(int)    # we convert the str datatypes of episodes number into integers so that we can apply aggregation functions easily.

In [109]:
df.head()

   Rank                                              Title  Score  Episodes
0     1  Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...   9.10        64
1     2  Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...   9.07        24
2     3  Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...   9.06        13
3     4  GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...   9.06        51
4     5  Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...   9.05        10

-make a new column for time stamp

In [110]:
df.loc[0]['Title']  # here we observed that the time stamp is present in each title column.

'Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr 2009 - Jul 20103,218,472 membersManga StoreVolume 14.58Preview'

In [111]:

def extraction_time(txt):   # function to extract time stamp
    check = False
    data = ""
    for i in range(len(txt)):
        if txt[i] == ')':
            for j in range(i+1,i+20):
                data += txt[j]
            return data

In [112]:
df['Title'].apply(extraction_time)   # here we extract time stamp

0     Apr 2009 - Jul 2010
1     Apr 2011 - Sep 2011
2     Oct 2022 - Dec 2022
3     Apr 2015 - Mar 2016
4     Apr 2019 - Jul 2019
5     Apr 2011 - Mar 2012
6     Jan 2021 - Jan 2021
7     Oct 2011 - Sep 2014
8     Apr 2022 - Jun 2022
9     Oct 2012 - Mar 2013
10    Mar 2023 - May 2023
11    Jan 1988 - Mar 1997
12    Jul 2023 - Aug 2023
13    Apr 2021 - Jun 2021
14    Jan 2017 - Mar 2017
15    Apr 2006 - Mar 2010
16    Sep 2016 - Sep 2016
17    Oct 2017 - Mar 2018
18    Oct 2008 - Mar 2009
19    Apr 2008 - Sep 2008
20    Jul 2013 - Jul 2013
21    Sep 2020 - Sep 2020
22    Aug 2017 - Aug 2017
23    Jul 2018 - Oct 2018
24    Apr 2004 - Sep 2005
25    Aug 2016 - Aug 2016
26    Dec 2022 - Dec 2022
27    Oct 2022 - Dec 2022
28    Dec 2022 - Dec 2022
29    Jan 2023 - Jun 2023
30    Jul 2023 - Aug 2023
31    Jan 2018 - Mar 2018
32    Apr 2020 - Oct 2021
33    Jan 2019 - Apr 2019
34    Dec 2020 - Mar 2021
35    Dec 2021 - Feb 2022
36    Jan 2017 - Jan 2017
37    Apr 2023 - Jun 2023
38    Oct 2016 - Dec 2016
39    Jul 2001 - Jul 2001
40    Jul 2013 - Dec 2013
41    Jan 2022 - Apr 2022
42    Oct 2000 - Mar 2002
43    Apr 1998 - Apr 1999
44    Apr 2022 - Oct 2022
45    Jul 2019 - Dec 2019
46    Oct 2014 - Dec 2014
47    Jan 2017 - Mar 2017
48    Oct 2022 - Dec 2022
49    Feb 1999 - Sep 1999
Name: Title, dtype: object

In [113]:
df['Time Stamp'] = df['Title'].apply(extraction_time)  # we create a new column name Time Stamp in dataframe.

In [114]:
df.head()

,Rank,Title,Score,Episodes,Time Stamp
0,1,Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...,9.10,64,Apr 2009 - Jul 2010
1,2,"Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...",9.07,24,Apr 2011 - Sep 2011
2,3,Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...,9.06,13,Oct 2022 - Dec 2022
3,4,"GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...",9.06,51,Apr 2015 - Mar 2016
4,5,Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...,9.05,10,Apr 2019 - Jul 2019

In [115]:
# function to convert time stamp into number of months

from dateutil.relativedelta import relativedelta
from datetime import datetime

def calculate_total_months(period):
    try:
        start_str, end_str = period.split(' - ')
        start_date = datetime.strptime(start_str, '%b %Y')
        end_date = datetime.strptime(end_str, '%b %Y')
        r = relativedelta(end_date, start_date)
        return r.years * 12 + r.months + 1  # +1 to include the starting month
    except:
        return None

In [116]:
df['Months'] = df['Time Stamp'].apply(calculate_total_months)

In [117]:
df.head()

,Rank,Title,Score,Episodes,Time Stamp,Months
0,1,Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...,9.10,64,Apr 2009 - Jul 2010,16
1,2,"Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...",9.07,24,Apr 2011 - Sep 2011,6
2,3,Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...,9.06,13,Oct 2022 - Dec 2022,3
3,4,"GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...",9.06,51,Apr 2015 - Mar 2016,12
4,5,Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...,9.05,10,Apr 2019 - Jul 2019,4

In [118]:
# which anime has the highest score

df[df['Score'] == df['Score'].max()]['Title']

0    Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...
Name: Title, dtype: object

In [119]:
# give me top 5 highest scoring anime

df['Title'].head()     # dataset is ranked on the basis of score so we can find directly

0    Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...
1    Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...
2    Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...
3    GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...
4    Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...
Name: Title, dtype: object

In [120]:
# which anime has the highest episode count

df[df['Episodes'] == df['Episodes'].max()]['Title']

15    GintamaTV (201 eps)Apr 2006 - Mar 20101,034,41...
Name: Title, dtype: object

In [121]:
# animes with top 5 episode count

df['Episodes'].value_counts().head(5)

Episodes
1     9
13    6
12    6
24    4
26    4
Name: count, dtype: int64

In [122]:
#which is the longest running anime

df[df['Months'] == df['Months'].max()]['Title']

11    Ginga Eiyuu DensetsuOVA (110 eps)Jan 1988 - Ma...
Name: Title, dtype: object

# Feature Extraction (Project 2)

- Loading the dataset

In [123]:
df = pd.read_csv(r'Countries.csv')

In [124]:
df.head()

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,...,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
0,Afghanistan,Islamic State of Afghanistan,Afghan afghani,Kabul,Southern Asia,Asia,Afghan,33.0,65.0,383560.0,...,41128771,27.01610,30181937,10946834,2.14,2.97,Authoritarian,12.9,Ashraf Ghani,President
1,Albania,Republic of Albania,Albanian lek,Tirana,Southern Europe,Europe,Albanian,41.0,20.0,11655.5,...,2775634,35.71430,1004807,1770827,2.62,5.98,Hybrid regime,33.7,Edi Rama,Prime Minister
2,Algeria,People's Democratic Republic of Algeria,Algerian dinar,Algiers,Northern Africa,Africa,Algerian,28.0,3.0,413588.0,...,44903225,8.10811,11328186,33575039,1.71,3.50,Authoritarian,24.0,Abdelmadjid Tebboune,President
3,Andorra,Principality of Andorra,Euro,Andorra la Vella,Southern Europe,Europe,Andorran,42.5,1.5,187.2,...,79824,46.42860,9730,70094,3.17,0.00,Unknown,38.9,Xavier Espot Zamora,Head of Government
4,Angola,People's Republic of Angola,Angolan kwanza,Luanda,Middle Africa,Africa,Angolan,-12.5,18.5,569525.0,...,35588987,33.63640,11359649,24229338,2.24,3.62,Authoritarian,12.4,Joo Loureno,President

In [125]:
df.shape

(194, 64)

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 194 entries, 0 to 193
Data columns (total 64 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   country                                  194 non-null    object
 1   country_long                             194 non-null    object
 2   currency                                 194 non-null    object
 3   capital_city                             194 non-null    object
 4   region                                   194 non-null    object
 5   continent                                194 non-null    object
 6   demonym                                  194 non-null    object
 7   latitude                                 194 non-null    float64
 8   longitude                                194 non-null    float64
 9   agricultural_land                        193 non-null    float64
 10  forest_area                              194 non-null    float64
 11  land_area                                194 non-null    float64
 12  rural_land                               194 non-null    float64
 13  urban_land                               194 non-null    float64
 14  central_government_debt_pct_gdp          120 non-null    float64
 15  expense_pct_gdp                          156 non-null    float64
 16  gdp                                      193 non-null    float64
 17  inflation                                184 non-null    float64
 18  self_employed_pct                        179 non-null    float64
 19  tax_revenue_pct_gdp                      159 non-null    float64
 20  unemployment_pct                         179 non-null    float64
 21  vulnerable_employment_pct                179 non-null    float64
 22  electricity_access_pct                   194 non-null    float64
 23  alternative_nuclear_energy_pct           138 non-null    float64
 24  electricty_production_coal_pct           138 non-null    float64
 25  electricty_production_hydroelectric_pct  138 non-null    float64
 26  electricty_production_gas_pct            138 non-null    float64
 27  electricty_production_nuclear_pct        138 non-null    float64
 28  electricty_production_oil_pct            138 non-null    float64
 29  electricty_production_renewable_pct      138 non-null    float64
 30  energy_imports_pct                       138 non-null    float64
 31  fossil_energy_consumption_pct            168 non-null    float64
 32  renewable_energy_consumption_pct         192 non-null    float64
 33  co2_emissions                            191 non-null    float64
 34  methane_emissions                        191 non-null    float64
 35  nitrous_oxide_emissions                  191 non-null    float64
 36  greenhouse_other_emissions               184 non-null    float64
 37  urban_population_under_5m                194 non-null    float64
 38  health_expenditure_pct_gdp               190 non-null    float64
 39  health_expenditure_capita                190 non-null    float64
 40  hospital_beds                            192 non-null    float64
 41  hiv_incidence                            133 non-null    float64
 42  suicide_rate                             183 non-null    float64
 43  armed_forces                             174 non-null    float64
 44  internally_displaced_persons             73 non-null     float64
 45  military_expenditure_pct_gdp             163 non-null    float64
 46  birth_rate                               194 non-null    float64
 47  death_rate                               194 non-null    float64
 48  fertility_rate                           193 non-null    float64
 49  internet_pct                             194 non-null    float64
 50  life_expectancy                          191 non-null    float64
 51  net_migration                            194 non-null    int64
 52  population_female                        194 non-null    int64
 53  population_male                          194 non-null    int64
 54  population                               194 non-null    int64
 55  women_parliament_seats_pct               193 non-null    float64
 56  rural_population                         194 non-null    int64
 57  urban_population                         194 non-null    int64
 58  press                                    194 non-null    float64
 59  democracy_score                          194 non-null    float64
 60  democracy_type                           194 non-null    object
 61  median_age                               194 non-null    float64
 62  political_leader                         187 non-null    object
 63  title                                    187 non-null    object
dtypes: float64(48), int64(6), object(10)
memory usage: 97.1+ KB

In [127]:
df.describe()

,latitude,longitude,agricultural_land,forest_area,land_area,rural_land,urban_land,central_government_debt_pct_gdp,expense_pct_gdp,gdp,...,net_migration,population_female,population_male,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,median_age
count,194.000000,194.000000,1.930000e+02,1.940000e+02,1.940000e+02,1.940000e+02,194.000000,120.000000,156.000000,1.930000e+02,...,194.000000,1.940000e+02,1.940000e+02,1.940000e+02,193.000000,1.940000e+02,1.940000e+02,194.000000,194.000000,194.000000
mean,18.975601,22.027491,2.454551e+05,2.086784e+05,6.675087e+05,6.563711e+05,9777.116531,66.759366,30.051403,5.144851e+11,...,-51.407216,2.028316e+07,2.050572e+07,4.078888e+07,25.022994,1.763322e+07,2.315566e+07,2.539330,4.644536,25.661856
std,23.876225,66.396389,6.356268e+05,7.824926e+05,1.837107e+06,1.811169e+06,42301.458421,71.806247,26.740880,2.307148e+12,...,94525.968598,7.258941e+07,7.607158e+07,1.486470e+08,12.671044,7.664187e+07,7.940393e+07,1.800128,2.818297,9.415569
min,-41.000000,-175.000000,4.000000e+00,0.000000e+00,2.027000e+00,3.495450e-02,0.000000,0.000000,0.000267,6.034940e+07,...,-525116.000000,5.513000e+03,5.799000e+03,1.131200e+04,0.000000,0.000000e+00,5.717000e+03,0.000000,0.000000,10.500000
25%,4.000000,-5.000000,6.464000e+03,3.331775e+03,2.355250e+04,2.186562e+04,359.618250,31.951300,18.371875,1.181390e+10,...,-12242.250000,1.036218e+06,1.044902e+06,2.106358e+06,15.384600,5.896640e+05,1.222244e+06,1.525000,2.722500,16.950000
50%,16.583333,21.500000,3.872780e+04,2.528925e+04,1.203750e+05,1.159945e+05,1645.170000,55.426850,27.337750,4.115390e+10,...,-970.000000,4.502713e+06,4.450049e+06,9.125614e+06,25.252500,2.512382e+06,4.508837e+06,2.400000,5.050000,24.950000
75%,40.000000,50.162500,2.150000e+05,1.236735e+05,5.237000e+05,4.911505e+05,4054.022500,79.539300,35.083500,2.519450e+11,...,2904.250000,1.526606e+07,1.478872e+07,3.031361e+07,33.636400,1.133354e+07,1.621355e+07,2.925000,6.967500,34.050000
max,65.000000,178.000000,5.285080e+06,8.153120e+06,1.637690e+07,1.622420e+07,522345.000000,687.994000,310.443000,2.546270e+13,...,561580.000000,6.915285e+08,7.311805e+08,1.417173e+09,61.250000,9.088048e+08,8.975784e+08,10.000000,9.870000,50.500000

In [128]:
#which country has the highest population

df[df['population'] == df['population'].max()]['country']

75    India
Name: country, dtype: object

In [129]:
#what is the capital of the country with highest population

df[df['population'] == df['population'].max()]['capital_city']

75    New Delhi
Name: capital_city, dtype: object

In [130]:
#which country has the least population

df[df['population'] == df['population'].min()]['country']

179    Tuvalu
Name: country, dtype: object

In [131]:
#what is the capital of the country with least population.

df[df['population'] == df['population'].min()]['capital_city']

179    Funafuti
Name: capital_city, dtype: object

In [132]:
#give me top 5 countries with highest democratic score

df.sort_values(by='democracy_score', ascending=False).head()['country']

127         Norway
74         Iceland
164         Sweden
122    New Zealand
46         Denmark
Name: country, dtype: object

In [133]:
#how many total regions are there

df['region'].value_counts().count()

np.int64(22)

In [134]:
#how many countries lie in Eastern Europe region

df['region'].value_counts()['Eastern Europe']

np.int64(10)

In [135]:
#who is the political leader of the 2nd highest populated country

df[df['population'] == df['population'].nlargest(2).iloc[1]]['political_leader']

34    Xi Jinping
Name: political_leader, dtype: object

In [136]:
# how many countries are there whoes political leaders are unknown

df[df['political_leader'].isna()]['country'].count()

np.int64(7)

In [137]:
#how many country have Republic in their full name

count = 0
def counting(txt):
    global count 
    if 'republic' in txt.lower():
        count+= 1
    return txt

In [138]:
df['country_long'] = df['country_long'].apply(counting)
print(count)

125

In [139]:
#which country in african region has highest population


africa_df = df[df['continent'] == 'Africa']

In [140]:
africa_df[africa_df['population'] == africa_df['population'].max()]['country']

125    Nigeria
Name: country, dtype: object